MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX450F128L.atdf
         <register caption="USB Interrupt Register" name="U1IR" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URSTIF_DETACHIF" />
            <bitfield caption="USB Error Condition Interrupt bit" mask="0x00000002" name="UERRIF" values="U1IR__UERRIF" />
            <bitfield caption="SOF Token Interrupt bit" mask="0x00000004" name="SOFIF" values="U1IR__SOFIF" />
            <bitfield caption="Token Processing Complete Interrupt bit" mask="0x00000008" name="TRNIF" values="U1IR__TRNIF" />
            <bitfield caption="Idle Detect Interrupt bit" mask="0x00000010" name="IDLEIF" values="U1IR__IDLEIF" />
            <bitfield caption="Resume Interrupt bit" mask="0x00000020" name="RESUMEIF" values="U1IR__RESUMEIF" />
            <bitfield caption="Peripheral Attach Interrupt bit" mask="0x00000040" name="ATTACHIF" values="U1IR__ATTACHIF" />
            <bitfield caption="STALL Handshake Interrupt bit" mask="0x00000080" name="STALLIF" values="U1IR__STALLIF" />
         </register>
         <register caption="USB Interrupt Enable Register" name="U1IE" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="URSTIE_DETACHIE" />
            <bitfield caption="USB Error Interrupt Enable bit" mask="0x00000002" name="UERRIE" values="U1IE__UERRIE" />
            <bitfield caption="SOF Token Interrupt Enable bit" mask="0x00000004" name="SOFIE" values="U1IE__SOFIE" />
            <bitfield caption="Token Processing Complete Interrupt Enable bit" mask="0x00000008" name="TRNIE" values="U1IE__TRNIE" />
            <bitfield caption="Idle Detect Interrupt Enable bit" mask="0x00000010" name="IDLEIE" values="U1IE__IDLEIE" />
            <bitfield caption="RESUME Interrupt Enable bit" mask="0x00000020" name="RESUMEIE" values="U1IE__RESUMEIE" />
            <bitfield caption="ATTACH Interrupt Enable bit" mask="0x00000040" name="ATTACHIE" values="U1IE__ATTACHIE" />
            <bitfield caption="STALL Handshake Interrupt Enable bit" mask="0x00000080" name="STALLIE" values="U1IE__STALLIE" />
         </register>
         <register caption="USB Error Interrupt Status Register" name="U1EIR" offset="0x1e0" rw="RW" size="4">
            <bitfield caption="PID Check Failure Flag bit" mask="0x00000001" name="PIDEF" values="U1EIR__PIDEF" />
            <bitfield mask="0x00000002" name="CRC5EF" />
            <bitfield caption="CRC16 Failure Flag bit" mask="0x00000004" name="CRC16EF" values="U1EIR__CRC16EF" />
            <bitfield caption="Data Field Size Error Flag bit" mask="0x00000008" name="DFN8EF" values="U1EIR__DFN8EF" />
            <bitfield caption="Bus Turnaround Time-Out Error Flag bit" mask="0x00000010" name="BTOEF" values="U1EIR__BTOEF" />
            <bitfield caption="DMA Error Flag bit" mask="0x00000020" name="DMAEF" values="U1EIR__DMAEF" />
            <bitfield caption="Bus Matrix Error Flag bit" mask="0x00000040" name="BMXEF" values="U1EIR__BMXEF" />
            <bitfield caption="Bit Stuff Error Flag bit" mask="0x00000080" name="BTSEF" values="U1EIR__BTSEF" />
         </register>
         <register caption="USB Error Interrupt Enable Register" name="U1EIE" offset="0x1f0" rw="RW" size="4">
            <bitfield caption="PID Check Failure Interrupt Enable bit" mask="0x00000001" name="PIDEE" values="U1EIE__PIDEE" />
            <bitfield mask="0x00000002" name="CRC5EE_EOFEE" />
            <bitfield caption="CRC16 Failure Interrupt Enable bit" mask="0x00000004" name="CRC16EE" values="U1EIE__CRC16EE" />
            <bitfield caption="Data Field Size Error Interrupt Enable bit" mask="0x00000008" name="DFN8EE" values="U1EIE__DFN8EE" />
            <bitfield caption="Bus Turnaround Time-out Error Interrupt Enable bit" mask="0x00000010" name="BTOEE" values="U1EIE__BTOEE" />
            <bitfield caption="DMA Error Interrupt Enable bit" mask="0x00000020" name="DMAEE" values="U1EIE__DMAEE" />
            <bitfield caption="Bus Matrix Error Interrupt Enable bit" mask="0x00000040" name="BMXEE" values="U1EIE__BMXEE" />
            <bitfield caption="Bit Stuff Error Interrupt Enable bit" mask="0x00000080" name="BTSEE" values="U1EIE__BTSEE" />
         </register>
         <register caption="USB Status Register" name="U1STAT" offset="0x200" rw="R" size="4">
            <bitfield caption="Ping-Pong BD Pointer Indicator bit" mask="0x00000004" name="PPBI" values="U1STAT__PPBI" />
            <bitfield caption="Last BD Direction Indicator bit" mask="0x00000008" name="DIR" values="U1STAT__DIR" />
            <bitfield caption="Encoded Number of Last Endpoint Activity bits" mask="0x000000F0" name="ENDPT" values="U1STAT__ENDPT" />
         </register>
         <register caption="USB Control Register" name="U1CON" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="USBEN_SOFEN" />
            <bitfield caption="Ping-Pong Buffers Reset bit" mask="0x00000002" name="PPBRST" values="U1CON__PPBRST" />
            <bitfield caption="RESUME Signaling Enable bit" mask="0x00000004" name="RESUME" values="U1CON__RESUME" />
            <bitfield caption="Host Mode Enable bit" mask="0x00000008" name="HOSTEN" values="U1CON__HOSTEN" />
            <bitfield caption="Module Reset bit" mask="0x00000010" name="USBRST" values="U1CON__USBRST" />
            <bitfield mask="0x00000020" name="PKTDIS_TOKBUSY" />
            <bitfield caption="Live Single-Ended Zero flag bit" mask="0x00000040" name="SE0" values="U1CON__SE0" />
            <bitfield caption="Live Differential Receiver JSTATE flag bit" mask="0x00000080" name="JSTATE" values="U1CON__JSTATE" />
         </register>
         <register caption="USB Address Register" name="U1ADDR" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="DEVADDR" />
            <bitfield caption="Low Speed Enable Indicator bit" mask="0x00000080" name="LSPDEN" values="U1ADDR__LSPDEN" />
         </register>
         <register caption="USB BDT Page 1 Register" name="U1BDTP1" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x000000FE" name="BDTPTRL" />
         </register>
         <register caption="USB Frame Number Low Register" name="U1FRML" offset="0x240" rw="R" size="4">
            <bitfield mask="0x000000FF" name="FRML" />
         </register>
         <register caption="USB Frame Number High Register" name="U1FRMH" offset="0x250" rw="R" size="4">
            <bitfield mask="0x00000007" name="FRMH" />
         </register>
         <register caption="USB Token Register" name="U1TOK" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="EP" />
            <bitfield caption="Token Type Indicator bits" mask="0x000000F0" name="PID" values="U1TOK__PID" />
         </register>
         <register caption="USB SOF Threshold Register" name="U1SOF" offset="0x270" rw="RW" size="4">
            <bitfield caption="SOF Threshold Value bits" mask="0x000000FF" name="CNT" values="U1SOF__CNT" />
         </register>
         <register caption="USB BDT PAGE 2 Register" name="U1BDTP2" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="BDTPTRH" />
         </register>
